Revit API Introduction Labs
Lab6_5_RibbonExplorer Class
 List the contents of the Revit ribbon in the Visual Studio debug output window.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab6_5_RibbonExplorer : IExternalCommand
Visual Basic (Declaration)
Public Class Lab6_5_RibbonExplorer _
	Implements IExternalCommand
Visual C++
public ref class Lab6_5_RibbonExplorer : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab6_5_RibbonExplorer
See Also
Lab6_5_RibbonExplorer Members
Labs Namespace